Repository: Tarasyonok/pet-project-forum
Catalog: django_forum/locale/*/LC_MESSAGES/django.po
Languages: ru

source: What's your question?
ru: В чём вопрос?

source: Describe your problem in detail...
ru: Опиши проблему подробнее...

source: Write your answer here...
ru: Напиши свой ответ здесь...

source: Only question author can accept answers
ru: Только автор вопроса может отметить ответ как верный

source: e.g., Django Masterclass, Python Basics...
ru: Например: «Django Masterclass», «Основы Python»...

source: Brief summary of your review...
ru: Коротко о впечатлениях...

source: Share your experience with this course...
ru: Поделись впечатлениями от курса...

source: You have already reviewed '%(course_name)s'. You can <a href='%(review_url)s'>view your existing review</a> or <a href='%(edit_url)s'>edit it</a>.
ru: Ты уже оставлял отзыв на «%(course_name)s». Можешь <a href='%(review_url)s'>посмотреть его</a> или <a href='%(edit_url)s'>что-то изменить</a>.

source: Page Not Found
ru: Страница не найдена

source: The panda couldn't find this page. Maybe it's eating bamboo somewhere else?
ru: Панда не нашла эту страницу. Может, она пошла за бамбуком?

source: Back to Home
ru: На главную

source: Night Coder - Code Together, Grow Together
ru: Night Coder — Программируем вместе, растем вместе

source: Night Coder Panda
ru: Панда Night Coder

source: Delete Answer - Night Coder
ru: Удалить ответ — Night Coder

source: Delete Answer
ru: Удалить ответ

source: Are you sure you want to delete this answer?
ru: Точно удалить ответ?

source: Question:
ru: Вопрос:

source: Your answer:
ru: Твой ответ:

source: This action cannot be undone. All votes associated with this answer will also be permanently deleted.
ru: Это действие необратимо. Все голоса за этот ответ тоже удалятся навсегда.

source: Cancel
ru: Отмена

source: Edit Answer - Night Coder
ru: Редактировать ответ — Night Coder

source: Edit Your Answer
ru: Редактировать ответ

source: Improve your answer to better help the community.
ru: Улучши ответ — помоги сообществу.

source: Edit Answer
ru: Редактировать ответ

source: Your Answer *
ru: Твой ответ *

source: Update Answer
ru: Обновить ответ

source: Writing a Good Answer
ru: Как дать хороший ответ

source: Be clear and concise
ru: Будь понятным и кратким

source: in your explanation
ru: в объяснении

source: Include code examples
ru: Добавь примеры кода

source: if they help explain
ru: если они прояснят суть

source: Explain why
ru: Объясни, почему

source: your solution works
ru: решение работает

source: Consider edge cases
ru: Учти крайние случаи

source: and limitations
ru: и ограничения

source: Be respectful and helpful
ru: Будь вежливым и полезным

source: to the asker
ru: для автора вопроса

source: Delete Question - Night Coder
ru: Удалить вопрос — Night Coder

source: Delete Question
ru: Удалить вопрос

source: Are you sure you want to delete this question?
ru: Точно удалить вопрос?

source: This action cannot be undone. All answers and votes associated with this question will also be permanently deleted.
ru: Это действие необратимо. Все ответы и голоса за этот вопрос тоже удалятся навсегда.

source: Back to All Questions
ru: Назад к списку вопросов

source: Question Details
ru: Детали вопроса

source: Answer Question
ru: Ответить

source: Can't vote on your own content
ru: Нельзя голосовать за своё

source: Login to vote
ru: Войди, чтобы голосовать

source: Upvote (+5 reputation)
ru: Лайк (+5 к репутации)

source: Downvote (-2 reputation)
ru: Дизлайк (-2 к репутации)

source: Solved
ru: Решено

source: Actions
ru: Действия

source: Edit Question
ru: Редактировать вопрос

source: rep
ru: реп.

source: ago
ru: назад

source: Edited
ru: Изменён

source: views
ru: просмотры

source: Answers
ru: Ответы

source: Upvote (+10 reputation)
ru: Лайк (+10 к репутации)

source: Mark as accepted answer (+15 reputation)
ru: Отметить как верный ответ (+15 к репутации)

source: Accept
ru: Принять

source: Accepted answer
ru: Верный ответ

source: Accepted
ru: Принят

source: Accepted Answer
ru: Верный ответ

source: Edit
ru: Изменить

source: Delete
ru: Удалить

source: No answers yet
ru: Пока нет ответов

source: Be the first to help solve this problem!
ru: Стань первым, кто поможет с решением!

source: Your Answer
ru: Твой ответ

source: Be specific and include any code examples if relevant
ru: Будь конкретным, добавь примеры кода, если нужно

source: Post Answer
ru: Опубликовать

source: Join the Discussion
ru: Присоединиться к обсуждению

source: Sign in to post your answer and help solve this problem.
ru: Войди, чтобы ответить и помочь с решением.

source: Login
ru: Войти

source: Sign Up
ru: Регистрация

source: Ask Question - Night Coder
ru: Задать вопрос — Night Coder

source: Edit Your Question
ru: Редактировать вопрос

source: Ask a Question
ru: Задать вопрос

source: Improve your question to get better answers from the community.
ru: Улучши вопрос, чтобы получить более точные ответы.

source: Get help from thousands of developers working through the night.
ru: Получи помощь от тысяч разработчиков, которые работают ночами.

source: Question Title *
ru: Заголовок вопроса *

source: Detailed Description *
ru: Подробное описание *

source: Update Question
ru: Обновить вопрос

source: Post Question
ru: Опубликовать

source: Writing a Good Question
ru: Как задать хороший вопрос

source: Be specific
ru: Будь конкретным

source: about your problem
ru: в описании проблемы

source: if relevant
ru: если нужно

source: Describe what you've tried
ru: Опиши, что пробовал

source: already
ru: сделать

source: Mention your environment
ru: Укажи своё окружение

source: (OS, language version, etc.)
ru: (ОС, версия языка и т.д.)

source: Use a clear, descriptive title
ru: Придумай ясный и понятный заголовок

source: Night Coder - Questions & Answers
ru: Night Coder — Вопросы и ответы

source: Search Results
ru: Результаты поиска

source: Community Questions
ru: Вопросы сообщества

source: Found %(count)s results for "%(query)s"
ru: Найдено результатов: %(count)s по запросу «%(query)s»

source: Ask questions, share knowledge, and help fellow developers grow together.
ru: Задавай вопросы, делись знаниями и помогай другим разработчикам расти.

source: Search questions and answers...
ru: Искать вопросы и ответы...

source: Search questions
ru: Поиск вопросов

source: Search
ru: Найти

source: Search Results for
ru: Результаты поиска по запросу

source: questions found
ru: вопросов найдено

source: Search terms:
ru: Искали:

source: Results
ru: Результаты

source: Latest Questions
ru: Свежие вопросы

source: total
ru: всего

source: votes
ru: голосов

source: answers
ru: ответов

source: No questions found
ru: Вопросы не найдены

source: Try different search terms or browse all questions.
ru: Попробуй другие слова или посмотри все вопросы.

source: Be the first to ask a question and help build our community!
ru: Стань первым, задай вопрос и помоги нашему сообществу расти!

source: Ask First Question
ru: Задать первый вопрос

source: Question pagination
ru: Навигация по вопросам

source: Previous
ru: Назад

source: Next
ru: Вперёд

source: Ready to Ask?
ru: Готов задать вопрос?

source: Join the Community
ru: Вступи в сообщество

source: Sign up to ask questions, answer others, and build your reputation.
ru: Зарегистрируйся, чтобы задавать вопросы, помогать другим и зарабатывать репутацию.

source: Start Coding Free
ru: Начать бесплатно

source: Forum Stats
ru: Статистика форума

source: Questions
ru: Вопросы

source: Active
ru: Активные

source: Night Coder - Where Developers Grow Together
ru: Night Coder — Здесь разработчики растут вместе

source: Code Doesn't Sleep.
ru: Код не спит.

source: Neither Do We.
ru: Как и мы.

source: Join thousands of coders, learn, and grow together.
ru: Присоединяйся к тысячам программистов, учись и расти вместе с нами.

source: Get unstuck, share knowledge, and build your reputation in the developer community.
ru: Получи помощь, делись знаниями и зарабатывай репутацию в сообществе разработчиков.

source: Browse Questions
ru: Смотреть вопросы

source: Help Others
ru: Помочь другим

source: Latest activity
ru: Недавняя активность

source: Reputation
ru: Репутация

source: Reviews
ru: Отзывы

source: Ranked #%(user_rank)s on leaderboards
ru: Ты на %(user_rank)s-м месте в рейтинге

source: View All
ru: Смотреть все

source: No questions yet. Be the first to ask!
ru: Пока нет вопросов. Стань первым!

source: Latest Course Reviews
ru: Свежие отзывы о курсах

source: No reviews yet. Share your course experience!
ru: Пока нет отзывов. Поделись впечатлениями о курсе!

source: Top Contributors
ru: Лучшие участники

source: Q
ru: В

source: A
ru: О

source: View Full Leaderboard
ru: Весь рейтинг

source: Community Stats
ru: Статистика сообщества

source: Developers
ru: Разработчики

source: Ask questions, share reviews, <br> and grow as developers in the quiet hours.
ru: Задавай вопросы, пиши отзывы <br> и расти как разработчик в тихие часы.

source: Explore
ru: Разделы

source: Forum
ru: Форум

source: Leaderboards
ru: Рейтинг

source: Community
ru: Сообщество

source: questions
ru: вопросов

source: reviews
ru: отзывов

source: Night Stats
ru: Ночная статистика

source: Online Now
ru: Сейчас онлайн

source: Questions Tonight
ru: Вопросов за ночь

source: &copy; 2025 Night Coder. Built with ☕ and 🌙 by developers, for developers.
ru: &copy; 2025 Night Coder. Сделано с ☕ и 🌙 разработчиками для разработчиков.

source: Current Time:
ru: Текущее время:

source: My Profile
ru: Мой профиль

source: Edit Profile
ru: Редактировать профиль

source: Ask Question
ru: Задать вопрос

source: Write Review
ru: Написать отзыв

source: Logout
ru: Выйти

source: Join Free
ru: Зарегистрироваться

source: Night Coder - Leaderboards
ru: Night Coder — Рейтинг участников

source: Developer Leaderboards
ru: Рейтинг разработчиков

source: Celebrate the most active and helpful developers in our community. Earn reputation by asking questions, answering others, and writing helpful reviews.
ru: Знакомься с самыми активными и полезными разработчиками нашего сообщества. Зарабатывай репутацию, задавая вопросы, помогая другим и оставляя полезные отзывы.

source: This Month
ru: В этом месяце

source: Active Community
ru: Активное сообщество

source: Leaderboard stats
ru: Статистика рейтинга

source: Just now
ru: Только что

source: All-Time Reputation Leaders
ru: Лидеры репутации за всё время

source: Top 20 Developers
ru: Топ-20 разработчиков

source: rank
ru: место

source: reputation
ru: репутация

source: total rep
ru: вся реп.

source: No leaders yet
ru: Пока нет лидеров

source: Be the first to earn reputation and top the leaderboard!
ru: Стань первым, заработай репутацию и возглавь рейтинг!

source: How to Earn Reputation
ru: Как заработать репутацию

source: Question upvoted
ru: За вопрос проголосовали

source: Answer upvoted
ru: За ответ проголосовали

source: Answer accepted
ru: Ответ принят

source: Review upvoted
ru: За отзыв проголосовали

source: Reputation helps build trust and recognition in the community
ru: Репутация помогает завоевать доверие и признание в сообществе

source: This Month's Top Contributors
ru: Лучшие участники месяца

source: No monthly leaders yet
ru: Пока нет лидеров за месяц

source: Updated monthly • Based on recent activity
ru: Обновляется ежемесячно • На основе недавней активности

source: Your Ranking
ru: Твоё место

source: reputation points
ru: очков репутации

source: Join the Leaderboard
ru: Войти в рейтинг

source: Sign up to start earning reputation and climb the ranks!
ru: Зарегистрируйся, чтобы начать зарабатывать репутацию и подниматься в рейтинге!

source: Quick Actions
ru: Быстрые действия

source: Read Reviews
ru: Читать отзывы

source: Delete Review - Night Coder
ru: Удалить отзыв — Night Coder

source: Delete Review
ru: Удалить отзыв

source: Are you sure you want to delete this review?
ru: Точно удалить отзыв?

source: This action cannot be undone. All votes associated with this review will also be permanently deleted.
ru: Это действие необратимо. Все голоса за этот отзыв тоже удалятся навсегда.

source: Before you delete...
ru: Прежде чем удалить...

source: • This review has <strong class="text-warning">%(review.vote_count)s</strong> votes
ru: • У этого отзыва <strong class="text-warning">%(review.vote_count)s</strong> голосов

source: It was viewed by other developers seeking course recommendations
ru: Его видели другие разработчики в поисках рекомендаций по курсам

source: Consider editing instead if you want to improve the content
ru: Если хочешь что-то улучшить, лучше отредактируй отзыв

source: Back to All Reviews
ru: Назад к списку отзывов

source: Review Details
ru: Детали отзыва

source: Upvote this review
ru: Лайкнуть отзыв

source: Downvote this review
ru: Дизлайкнуть отзыв

source: Edit Review
ru: Редактировать отзыв

source: Was this review helpful? <strong class="text-warning">%(review.vote_count)s</strong> developers found it useful.
ru: Был ли отзыв полезен? <strong class="text-warning">%(review.vote_count)s</strong> разработчикам он помог.

source: More Reviews by %(review.author.username)s
ru: Ещё отзывы от %(review.author.username)s

source: No other reviews from this author yet.
ru: Пока нет других отзывов от этого автора.

source: View All Reviews by %(review.author.username)s
ru: Все отзывы от %(review.author.username)s

source: Error:
ru: Ошибка:

source: Write Review - Night Coder
ru: Написать отзыв — Night Coder

source: Edit Your Review
ru: Редактировать отзыв

source: Write a Course Review
ru: Написать отзыв о курсе

source: Improve your review to better help the community.
ru: Улучши отзыв — помоги сообществу.

source: Share your learning experience and help fellow developers choose the right courses.
ru: Поделись опытом обучения и помоги другим разработчикам выбрать подходящие курсы.

source: Course Name
ru: Название курса

source: Review Title
ru: Заголовок отзыва

source: Rating
ru: Оценка

source: Poor
ru: Плохо

source: Fair
ru: Нормально

source: Good
ru: Хорошо

source: Very Good
ru: Очень хорошо

source: Excellent
ru: Отлично

source: Select your rating
ru: Поставь оценку

source: Detailed Review
ru: Подробный отзыв

source: Update Review
ru: Обновить отзыв

source: Post Review
ru: Опубликовать

source: Writing a Helpful Review
ru: Как написать полезный отзыв

source: Be honest and balanced in your assessment
ru: Будь честным и объективным

source: Mention the instructor's teaching style
ru: Отметь стиль преподавания

source: Discuss course content quality and relevance
ru: Оцени качество и актуальность материалов

source: Note the difficulty level and prerequisites
ru: Укажи уровень сложности и требования

source: Share what you gained from the course
ru: Расскажи, что узнал нового

source: Please select a rating between 1 and 5 stars.
ru: Поставь оценку от 1 до 5 звёзд.

source: Night Coder - Course Reviews
ru: Night Coder — Отзывы о курсах

source: Search Reviews
ru: Поиск отзывов

source: Course Reviews
ru: Отзывы о курсах

source: Found %(results_count)s reviews for "%(query)s"
ru: Найдено отзывов: %(results_count)s по запросу «%(query)s»

source: Share your learning experience and help others choose the right courses.
ru: Делись опытом обучения и помогай другим выбирать подходящие курсы.

source: Search courses, titles, or content...
ru: Искать курсы, заголовки или текст...

source: Search reviews
ru: Поиск отзывов

source: Search Results for "%(query)s"
ru: Результаты поиска по запросу «%(query)s»

source: %(results_count)s reviews found
ru: Найдено отзывов: %(results_count)s

source: Latest Reviews
ru: Свежие отзывы

source: %(page_obj.paginator.count)s total
ru: Всего: %(page_obj.paginator.count)s

source: No reviews found
ru: Отзывы не найдены

source: Try different search terms or browse all reviews.
ru: Попробуй другие слова или посмотри все отзывы.

source: Be the first to share your course experience!
ru: Стань первым, поделись впечатлениями о курсе!

source: Write First Review
ru: Написать первый отзыв

source: Review pagination
ru: Навигация по отзывам

source: Share Your Experience
ru: Поделись опытом

source: Help fellow developers by reviewing courses you've taken.
ru: Помоги другим разработчикам — оставь отзыв о пройденных курсах.

source: Sign up to write reviews and help others make better learning choices.
ru: Зарегистрируйся, чтобы писать отзывы и помогать другим выбирать курсы.

source: Reviews Stats
ru: Статистика отзывов

source: Avg Rating
ru: Средняя оценка

source: Courses
ru: Курсы

source: Helpful Votes
ru: Полезные голоса

source: %(profile_user.username)s's Reviews - Night Coder
ru: Отзывы %(profile_user.username)s — Night Coder

source: %(profile_user.username)s's Reviews
ru: Отзывы %(profile_user.username)s

source: Course reviews and learning experiences shared by %(profile_user.username)s.
ru: Отзывы о курсах и опыт обучения от %(profile_user.username)s.

source: Total Reviews
ru: Всего отзывов

source: Average Rating
ru: Средний рейтинг

source: All Reviews
ru: Все отзывы

source: Sorted by Latest
ru: Сначала новые

source: No reviews yet
ru: Пока нет отзывов

source: You haven't written any course reviews yet.
ru: Ты ещё не написал ни одного отзыва о курсах.

source: %(profile_user.username)s hasn't written any course reviews yet.
ru: %(profile_user.username)s ещё не написал ни одного отзыва о курсах.

source: User reviews pagination
ru: Навигация по отзывам пользователя

source: User Profile
ru: Профиль пользователя

source: Write Another Review
ru: Написать ещё отзыв

source: Share your experience with another course.
ru: Поделись впечатлениями о другом курсе.

source: Sign In - Night Coder
ru: Вход — Night Coder

source: Welcome Back
ru: С возвращением

source: Continue your coding journey with Night Coder
ru: Продолжи свой путь в программировании с Night Coder

source: Username or Email
ru: Логин или email

source: Password
ru: Пароль

source: Remember me
ru: Запомнить меня

source: Sign In
ru: Войти

source: Forgot your password?
ru: Забыли пароль?

source: Don't have an account?
ru: Нет аккаунта?

source: Why Join Night Coder?
ru: Зачем вступать в Night Coder?

source: Ask coding questions
ru: Задавай вопросы по программированию

source: Help other developers
ru: Помогай другим разработчикам

source: Share course reviews
ru: Делись отзывами о курсах

source: Build your reputation
ru: Зарабатывай репутацию

source: Signed Out - Night Coder
ru: Выход — Night Coder

source: Signed Out Successfully
ru: Выход выполнен

source: See You Next Time, Coder!
ru: До скорого, программист!

source: You've been successfully signed out. The code will be waiting for your return.
ru: Ты вышел из аккаунта. Код будет ждать твоего возвращения.

source: Sign Back In
ru: Войти снова

source: Return Home
ru: На главную

source: Remember Why You Code
ru: Помни, зачем ты программируешь

source: Every line of code brings us closer to innovation. Rest, recharge, and come back stronger.
ru: Каждая строка кода приближает нас к инновациям. Отдохни, перезарядись и возвращайся с новыми силами.

source: Change Password - Night Coder
ru: Сменить пароль — Night Coder

source: Change Password
ru: Сменить пароль

source: Update your account password
ru: Обнови пароль от аккаунта

source: Current Password
ru: Текущий пароль

source: Enter your current password
ru: Введи текущий пароль

source: New Password
ru: Новый пароль

source: Enter your new password
ru: Введи новый пароль

source: Confirm New Password
ru: Подтверди новый пароль

source: Confirm your new password
ru: Подтверди новый пароль

source: Update Password
ru: Обновить пароль

source: Password Tips
ru: Советы по паролю

source: Use a strong, unique password
ru: Используй надёжный уникальный пароль

source: Include numbers and symbols
ru: Добавь цифры и символы

source: Avoid common words
ru: Избегай простых слов

source: Don't reuse passwords
ru: Не используй пароли повторно

source: Password Changed - Night Coder
ru: Пароль изменён — Night Coder

source: Password Updated
ru: Пароль обновлён

source: Security Enhanced!
ru: Безопасность усилена!

source: Your password has been successfully changed. Your account is now more secure.
ru: Пароль успешно изменён. Твой аккаунт теперь в большей безопасности.

source: Back to Profile
ru: В профиль

source: Go Home
ru: На главную

source: Keep Your Account Secure
ru: Как защитить аккаунт

source: Remember to use a strong, unique password and enable two-factor authentication for added security.
ru: Используй надёжный пароль и включи двухфакторную аутентификацию для дополнительной защиты.

source: Reset Password - Night Coder
ru: Сброс пароля — Night Coder

source: Reset Your Password
ru: Сбросить пароль

source: Enter your email to receive reset instructions
ru: Введи email, чтобы получить инструкции по сбросу

source: Email Address
ru: Email

source: your_email@example.com
ru: ваш_email@example.com

source: We'll send a password reset link to your email
ru: Мы отправим ссылку для сброса пароля на твой email

source: Send Reset Link
ru: Отправить ссылку

source: Back to Sign In
ru: Назад ко входу

source: Need Help?
ru: Нужна помощь?

source: If you're having trouble resetting your password, please check that you're entering the email address associated with your Night Coder account.
ru: Если не получается сбросить пароль, проверь, что вводишь email, привязанный к аккаунту Night Coder.

source: Still having issues? Contact our support team for assistance.
ru: Всё ещё есть проблемы? Обратись в службу поддержки.

source: Password Reset Complete - Night Coder
ru: Пароль сброшен — Night Coder

source: Password Reset Complete
ru: Пароль сброшен

source: Success!
ru: Готово!

source: Your password has been set. You may now sign in with your new password.
ru: Пароль установлен. Теперь можно войти с новым паролем.

source: Sign In Now
ru: Войти сейчас

source: Welcome Back, Coder!
ru: С возвращением, программист!

source: The community missed you. Dive back into coding challenges and help fellow developers.
ru: Сообщество скучало. Возвращайся к решению задач и помощи другим разработчикам.

source: Set New Password - Night Coder
ru: Задать новый пароль — Night Coder

source: Set New Password
ru: Задать новый пароль

source: Create a strong new password for your account
ru: Придумай надёжный новый пароль для аккаунта

source: Invalid Link
ru: Неверная ссылка

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
ru: Ссылка для сброса пароля недействительна, возможно, она уже использовалась. Запроси новую.

source: Request New Reset Link
ru: Запросить новую ссылку

source: Check Your Email - Night Coder
ru: Проверь email — Night Coder

source: Check Your Email
ru: Проверь email

source: Reset Link Sent!
ru: Ссылка отправлена!

source: We've emailed you instructions for setting your password. You should receive the email shortly!
ru: Мы отправили инструкции по смене пароля на твой email. Письмо должно прийти скоро!

source: Didn't receive the email?
ru: Не получил письмо?

source: Check your spam folder or
ru: Проверь папку «Спам» или

source: try again
ru: попробуй снова

source: Where Developers Grow Together
ru: Здесь разработчики растут вместе

source: Password Reset Request
ru: Запрос на сброс пароля

source: Hello
ru: Привет

source: We received a request to reset your password for your Night Coder account. If you didn't make this request, you can safely ignore this email.
ru: Мы получили запрос на сброс пароля для твоего аккаунта Night Coder. Если это был не ты, просто проигнорируй это письмо.

source: To reset your password, click the button below:
ru: Чтобы сбросить пароль, нажми на кнопку ниже:

source: Reset Password
ru: Сбросить пароль

source: Or copy and paste this link in your browser:
ru: Или скопируй и вставь эту ссылку в браузере:
