Repository: Tarasyonok/pet-project-forum
Catalog: django_forum/locale/*/LC_MESSAGES/django.po
Languages: ru

source: This link will expire in 24 hours for security reasons.
ru: Эта ссылка действительна 24 часа для безопасности.

source: Happy coding!
ru: Удачного кодинга!

source: The Night Coder Team
ru: Команда Night Coder

source: This email was sent to
ru: Это письмо отправлено на

source: If you have any questions, please contact our support team.
ru: Если есть вопросы, напиши в службу поддержки.

source: All rights reserved.
ru: Все права защищены.

source: Edit Profile - Night Coder
ru: Редактировать профиль — Night Coder

source: Edit Your Profile
ru: Редактировать профиль

source: Update your personal information and preferences
ru: Обнови личную информацию и настройки

source: Current avatar
ru: Текущий аватар

source: Profile Picture
ru: Фото профиля

source: First Name
ru: Имя

source: Your first name
ru: Твоё имя

source: Last Name
ru: Фамилия

source: Your last name
ru: Твоя фамилия

source: Birthday
ru: День рождения

source: Bio
ru: О себе

source: Tell other developers about yourself, your interests, and what you&lsquo;re learning...
ru: Расскажи другим разработчикам о себе, своих интересах и том, что изучаешь...

source: Share your coding journey, interests, and expertise with the community.
ru: Расскажи сообществу о своём пути в программировании, интересах и опыте.

source: Your Current Stats
ru: Твоя статистика

source: Save Changes
ru: Сохранить

source: Admin
ru: Админ

source: Member since %(join_date)s
ru: Участник с %(join_date)s

source: BDay
ru: ДР

source: Quick Stats
ru: Общая статистика

source: Reputation Sources
ru: Источники репутации

source: Question upvotes
ru: Голосов за вопросы

source: Answer upvotes
ru: Голосов за ответы

source: Accepted answers
ru: Принятых ответов

source: Review upvotes
ru: Голосов за отзывы

source: Total earned
ru: Всего заработано

source: No questions yet
ru: Пока нет вопросов

source: You haven't asked any questions yet.
ru: Ты ещё не задавал вопросов.

source: %(username)s hasn't asked any questions yet.
ru: %(username)s ещё не задавал вопросов.

source: Ask Your First Question
ru: Задать первый вопрос

source: You haven't answered any questions yet.
ru: Ты ещё не отвечал на вопросы.

source: %(username)s hasn't answered any questions yet.
ru: %(username)s ещё не отвечал на вопросы.

source: Help Other Developers
ru: Помочь другим разработчикам

source: Read full review
ru: Читать полностью

source: You haven't written any reviews yet.
ru: Ты ещё не писал отзывов.

source: %(username)s hasn't written any reviews yet.
ru: %(username)s ещё не писал отзывов.

source: Write Your First Review
ru: Написать первый отзыв

source: Join Night Coder - Start Your Coding Journey
ru: Присоединиться к Night Coder — Начни свой путь в программировании

source: Join Night Coder
ru: Присоединиться к Night Coder

source: Start your coding journey with thousands of developers
ru: Начни свой путь в программировании с тысячами разработчиков

source: Username
ru: Логин

source: This will be your public display name
ru: Это будет твоё публичное имя

source: Confirm Password
ru: Подтверди пароль

source: Create Account
ru: Создать аккаунт

source: Already have an account?
ru: Уже есть аккаунт?

source: Enter username
ru: Введи логин

source: Enter your password
ru: Введи пароль

source: Repeat the password
ru: Повтори пароль

source: Enter your username or email
ru: Введи логин или email

source: Year must be between %(min_year)s and %(max_year)s.
ru: Год должен быть между %(min_year)s и %(max_year)s.

source: Year must be exactly %(current_year)s.
ru: Год должен быть %(current_year)s.

source: Invalid vote type
ru: Неверный тип голоса

source: Cannot vote on your own content
ru: Нельзя голосовать за своё
